## Отчет по итогам автоматизации

### Что было запланировано и реализовано
В процессе работы была запланирована автоматизация тестирования приложения покупки тура "Путешествие дня" двумя способами: 
* Покупка тура картой;
* Покупка тура в кредит.

Было реализовано:
 * Тестовые сценарии приложения "Путешествие дня";
 * Автоматизация тестовых сценариев в количестве 54 теста:
    * UI-тесты;
    * тесты на корректность внесения данных;
 * Заведено 13 баг-репортов в Issue;
 * Сформирован Allure репорт.

### Сработавшие риски
* Усложненное написание автотестов, при отсутствии уникальных css-селекторов;
* Сложность в настройке окружения для поддержки двух СУБД для работы с приложением;
* Вследствие отсутствия полной документации и требований по работе приложения, необходимо было додумывать, с точки зрения здравого смысла и личного опыта, сценарий ожидаемого поведения приложения.
* Нестабильная работа Docker Desktop и системы затрудняло и увеличило время работы над прогоном автотестов. 

### Общий итог по времени.

Учитывая только непосредственное время работы над проектом, можно отметить, что работа была выполнена в срок.

Основное превышение времени над реализацией проекта в процессе непосредственной работы было связано с долговременной настройкой окружения, многократным прогоном автотестов, нестабильной работой Docker Desktop и системы.  
